# FLWByClass

## Description
Function FLWByClass returns whether the global attributes are set to use the line weight of the default class.

```pascal
FUNCTION FLWByClass : BOOLEAN;
```

```python
def vs.FLWByClass():
    return BOOLEAN
```

## Remarks
Returns whether the global attributes are set to use the line weight of the default class.
[sd 8/19/98]

## Examples
#### VectorScript ####
```pascal
useClassLWidth:=FLWByClass;
```
#### Python ####
```python
useClassLWidth = vs.FLWByClass()
```

```pascal
resultOK := FLWByClass;
```
```python
import vs

# Function FLWByClass returns whether the global attributes are set to use
# the line weight of the default class.
ok = vs.FLWByClass()
if ok:
    vs.Message('FLWByClass succeeded')
else:
    vs.Message('FLWByClass failed')
```

## Version
Availability: from VectorWorks8.0

## Category
* Document Attributes